In [3]:
import pandas as pd

data = pd.read_csv(
    "power.csv",
    names=["country", "year", "quantity", "category"],
    sep=",",
    dtype={
        "country": str,
        "year": int,
        "quantity": float,
        "category": int
    },
    skiprows=1  
)
print(data.head(15))

    country  year  quantity  category
0   Austria  1996       5.0         1
1   Austria  1995      17.0         1
2   Belgium  2014       0.0         1
3   Belgium  2013       0.0         1
4   Belgium  2012      35.0         1
5   Belgium  2011      25.0         1
6   Belgium  2010      22.0         1
7   Belgium  2009      45.0         1
8   Czechia  1998       1.0         1
9   Czechia  1995       7.0         1
10  Finland  2010       9.0         1
11  Finland  2009      13.0         1
12  Finland  2008      39.0         1
13  Finland  2007      21.0         1
14  Finland  2006       0.0         1

In [4]:
data.tail(-1)

          country  year  quantity  category
1         Austria  1995      17.0         1
2         Belgium  2014       0.0         1
3         Belgium  2013       0.0         1
4         Belgium  2012      35.0         1
5         Belgium  2011      25.0         1
...           ...   ...       ...       ...
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

[1189481 rows x 4 columns]

In [5]:
data["country"].value_counts()

country
Germany                                     20422
United States                               19847
Poland                                      19802
Austria                                     17440
Romania                                     17357
                                            ...
Antarctic Fisheries                            90
Pacific Islands (former)                       68
Yemen, Dem. (former)                           61
Yemen Arab Rep. (former)                       45
Commonwealth of Independent States (CIS)       16
Name: count, Length: 243, dtype: int64

In [26]:
df = pd.DataFrame([[1,'Bob', 'Builder'],
                  [2,'Sally', 'Baker'],
                  [3,'Scott', 'Candle Stick Maker']], 
columns=['id','name', 'occupation'])
print(df)

   id   name          occupation
0   1    Bob             Builder
1   2  Sally               Baker
2   3  Scott  Candle Stick Maker

In [42]:
data.columns

Index(['country', 'year', 'quantity', 'category'], dtype='object')